{"currentPage": 1, "results": [{"id": "59b36734-f2d6-46d7-97c0-06cfd2380852", "title": "Tokyo卍Revengers", "altTitles": [{"ru": "Токийские мстители"}, {"zh": "东京卍复仇者"}, {"ja": "東京卍リベンジャーズ"}, {"zh-hk": "東京卍復仇者"}, {"ja-ro": "Tōkyō manji ribenjāzu"}, {"tr": "Tokyo İntikamcıları"}, {"en": "Tokyo Revengers"}, {"en": "Tokyo Manji Revengers"}], "description": "Takemichi is a 26-year-old unemployed virgin who learns that the girl he dated in middle school, the only girl he ever dated, has died. Then, after an accident he finds himself in a time leap back to his middle school years. He vows to change the future and save the girl, and to do that he aims to rise to the top of the Kanto region's most brutal delinquent gang.\n\n---\n\n**Notes:**\n- The original Japanese title contains the manji symbol, so it will not be removed from the title on MangaDex.\n- Addendum on the \"Manji\" for those uninformed. From Seven Seas' Omnibus Edition:\n  *\"In East Asia the manji (卍) is an ancient religious symbol of power and good fortune for many different countries and religions around the world, including Buddhism, Hinduism, Jainism, and a number of Indo-European and Native American religions as well.\"* \n*\"The specific meaning of the symbol varies by nation and religion, and also by the position of the \"arms\" of the cross--whether they face left or right, or whether the cross is tilted or straight.\"* \n*\"In the 1930s, the swastika symbol--a clockwise, tilted cross--was adopted by the Nazi Political Party in Germany, and gained a negative reputation as a symbol of hatred in the modern world.\"*\n*\"The manji used by the Tokyo Manji Gang as their emblem is intended to be the ancient Buddhist symbol, as evidenced by the appearance of its counterclockwise, straight arms...\"*\n\n---\n\n**Links:**\n- [Official English Translation (Seven Seas)](https://sevenseasentertainment.com/series/tokyo-revengers-omnibus)\n- [Official English Translation (Kodansha USA)](https://kodansha.us/series/tokyo-revengers)", "status": "completed", "releaseDate": 2017, "contentRating": "safe", "lastVolume": "31", "lastChapter": "278"}, {"id": "f7b1ce54-67df-4e08-9e79-d7187faa3584", "title": "Tokyo 卍 Revengers: Baji Keisuke Kara no Tegami", "altTitles": [{"en": "Tokyo Revengers: Letter from Keisuke Baji"}, {"ja": "東京卍リベンジャーズ ～場地圭介からの手紙～"}, {"fr": "Tokyo Revengers: Lettre de Keisuke Baji"}, {"pt-br": "Tokyo Revengers: Cartas de Keisuke Baji"}, {"id": "Tokyo Revengers: Surat dari Keisuke Baji"}, {"ru": "Токийские Мстители: Письмо от Баджи Кейске"}], "description": "“Tokyo Revengers“ official spin-off!\n\nThe story of Keisuke Baji and Chifuyu Matsuno, from their first encounter to their separation. Chifuyu Matsuno, the First Division vice-captain, has not yet accepted the death of Keisuke Baji, the First Division captain, who died in the battle against Valhalla. At that time, a letter from Baji before his death arrives at his hand.\n\n---\n\n**Notes:**\n- The original Japanese title contains the manji symbol, so it will not be removed from the title on MangaDex. See the [main story](https://mangadex.org/title/59b36734-f2d6-46d7-97c0-06cfd2380852) description for more details.", "status": "ongoing", "releaseDate": 2022, "contentRating": "safe", "lastVolume": "", "lastChapter": ""}, {"id": "aa0bf81b-6cc6-4656-9b3f-231284e10a46", "title": "Tokyo Revengers: Brilliant Full Color Edition", "altTitles": [{"ja": "東京卍リベンジャーズ ブリリアント フルカラー版"}], "status": "ongoing", "releaseDate": 2023, "contentRating": "safe", "lastVolume": "", "lastChapter": ""}, {"id": "90c12e23-682a-4f73-93e1-4298cfa03dd5", "title": "Todai Revengers", "altTitles": [{"ja": "東大リベンジャーズ"}, {"en": "TokyoU Revengers"}], "description": "Michitake Icho learns on TV that his classmate Yuki Hayase, whom he had a crush on while at Todai University, has married a Keio University graduate. He lives in a shabby apartment with thin walls and is treated like an idiot even at his part-time job. One day, in the midst of his rock-bottom life, he is sent back in time to when he entered the University of Todai seven years ago! In order to save Yuki (?), he changes the life that he has been running away from. In order to change his life, Michitake, a no-good freelancer, sets his sights on the top of Todai University! The first official parody gag of \"Tokyo Manji Revengers\" in Japan!", "status": "completed", "releaseDate": 2021, "contentRating": "safe", "lastVolume": "6", "lastChapter": "69"}]}